entries/dockerizing-blog/index.html
<!DOCTYPE html>
<html>
    <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>Dockerizing my Jekyll Blog</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="Nebby about Tech">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/dockerizing-blog/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">
</head>


    <body>

        <header class="site-header">
  <div class="wrap">
    <a class="site-title" href="/">Joel's Journal</a>
  </div>
</header>


        <div class="page-content">
            <div class="wrap">
                <div class="post">
                    <header class="post-header">
                        <h1>Dockerizing my Jekyll Blog</h1>
                        <p class="meta">Jan 22, 2018</p>
                    </header>

                    <article class="post-content">
                        <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Background</a></li>
<li><a href="#sec-2">2. End Goal</a></li>
<li><a href="#sec-3">3. Lessons</a>
<ul>
<li><a href="#sec-3-1">3.1. When building docker images, look for existing <code>Dockerfile</code> examples</a></li>
<li><a href="#sec-3-2">3.2. Inter-application communication is trickier</a></li>
<li><a href="#sec-3-3">3.3. Use an entrypoint script</a></li>
<li><a href="#sec-3-4">3.4. Docker tools are weird</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Conclusion</a></li>
</ul>
</div>
</div>
<p>
Over the last several months, I have been using Docker more and more at work.
</p>

<p>
I have been wanting to apply it to something personal, and dockerizing my blog just made sense.
There were a number of weaknesses in the way my current blog works I wanted to address.
</p>

<p>
As I worked through it, I ran into enough "gotchas" that I thought a more thorough writeup was worth doing. <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
Hopefully I can help someone else who is new-ish to docker (or, more honestly, hopefully I stop making some of these
mistakes myself).
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>tl;dr</b> basically I have two services that need to run, <code>jekyll</code> and an <code>org-mode</code> compiler service.
</p>

<p>
Over time, I have grown less-and-less satisfied with Jekyll (and Markdown, especially).
I really wanted author posts in <code>org-mode</code>. Of course, there are several solutions that exist for this,
but the only one with the featues I wanted is the official implementation. So, I wrote a little <code>org-mode</code> compilation service.
A while ago I wrote about <a href="http://joelmccracken.github.io/entries/org-mode-jekyll-plugin/">the initial implementation</a>. That ended up being unacceptably slow, so I hacked together a little TCP service
that vastly improved performance. <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> End Goal</h2>
<div class="outline-text-2" id="text-2">
<p>
I wanted to have two separate containers, one running Jekyll, and the other running the Emacs service.
Additionally, I want the potential to add more services in the future.
</p>

<p>
The theoretical of attaining this is short to describe:
</p>

<ol class="org-ol">
<li>Find or build an image for each services' container.
</li>
<li>Experiment to find the correct container configuration for the services to run together.
<ol class="org-ol">
<li>Modify the application code in each service to facilitate the dockerization, if necessary.
</li>
</ol>
</li>
<li>Combine these configurations into a <code>docker-compose</code> file.
</li>
<li>Test, iterate, and use.
</li>
</ol>

<p>
As I alluded to earlier, this is harder than it sounds.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lessons</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> When building docker images, look for existing <code>Dockerfile</code> examples</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Sometimes, there might be a Docker image that does exactly what you need it to, and you won't have to build a custom image.
For me, this has rarely been the case.
</p>

<p>
In the case of my Jekyll image, I couldn't find an existing image that did what I wanted. The mistake I made at this point was to
try to figure it out without looking for any resources. I quickly ran into issues.
</p>

<p>
In fact, I have consistently found it surprisingly hard to dockerize software.
I always run into some unexpected environment issues &#x2013;
probably largely because of "minimal" base images<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>,
but there may be other issues in play.
</p>

<p>
Surprisingly (to me, at least), I found an emacs image that was perfect for my use. I used it as a base images to build the org compilation service.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Inter-application communication is trickier</h3>
<div class="outline-text-3" id="text-3-2">
<p>
When something runs on my machine, my default "go-to" solution is to use <code>localhost</code>. This has tripped me up a few times, since services in separate containers
are not on the same <code>localhost</code>. Components will often need to be reconfigured (for example,
<a href="https://github.com/joelmccracken/joelmccracken.github.com/commit/0f270d6a112529b1507c7df079af6cf5acb9f6fc#diff-aff17c3de884a9fa9b3ddfeddbdaf82fR60">a service may need to listen</a>
on <code>0.0.0.0</code> instead of <code>localhost</code>, and
<a href="https://github.com/joelmccracken/joelmccracken.github.com/commit/83d93eb78f52bba8a6d69d8e0a540b77fc3ab883#diff-63d56d6c9416c6f37fb26a8e756a7008R16">a client may need to connect</a>
to a the containers name, instead of <code>localhost</code>).
</p>

<p>
This is good to keep in mind, because when you run into it, if this is the problem you will have a much easier time than going through all the steps to debug
your network connectivity.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Use an entrypoint script</h3>
<div class="outline-text-3" id="text-3-3">
<p>
When building docker images, it is MUCH easier to have
<a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/writing/_emacs-org-compiler/start-server.sh">an entrypoint script</a>
than to attempt a complicated invocation within the <code>Dockerfile</code>'s <code>CMD</code> or <code>ENTRYPOINT</code> settings.
I have made this mistake several times. The syntax that <code>CMD</code> and <code>ENTRYPOINT</code> accept is weird.
It can be really non-obvious when these are not correct. Just use a run (or entrypoint) script to run your
container's application code.
</p>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Docker tools are weird</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Docker is an awesome tool, but I find many of its design decisions surprisingly limiting. I don't know how else to say it besides that.
Why can't I start an <b>existing, stopped</b> container with a different command than what it was created with? Why is it so hard to encode compilcated
scenarios in <code>docker-compose.yml</code> files?
</p>

<p>
In the end, I ended up with two separate <code>docker-compose.yml</code>, and the only differences between each of them is that one uses a different
<code>jekyll</code> command from the other. I also have three separate shell scripts in the <code>bin</code> directory which provide a nicer interface for:
</p>

<ol class="org-ol">
<li>Serving the site with Jekyll in drafts mode.
</li>
<li>Serving the production version of the site.
</li>
<li>Building and deploying the site.
</li>
</ol>

<p>
Could I possibly have simplified this into fewer pieces? I am sure I will in the future. But at the moment I've hit enough problems figuring out how to
do that that I just want to get some work done.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
I don't want to come across as overly negative about Docker. It is an incredible tool that has rightly received a lot of hype. Even though parts of
it are awkward to work with, containerized applications are just so nice that I believe the pain is well worth it.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
I keep telling myself that I need to write these things as I work on and learn things. And, I keep not doing it.
Here I am trying to break that pattern.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
At one point I wanted to write about that experience, which was actually kinda interesting (This was the first "raw tcp"
service I had ever written that was useful (as opposed to being a learning experience). There are a few interesting pieces:
</p>

<p class="footpara">
The <a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/444cac503c09d884ed148d961f449380b8ab72c5/_plugins/org-converter.rb">Jekyll plugin written in Ruby</a> which starts and stops the <code>org-mode</code> compilation service, and
<a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/0f270d6a112529b1507c7df079af6cf5acb9f6fc/_emacs-org-compiler/org-convert.el">the org-mode service</a> that receives the raw <code>org-mode</code> text over a socket and responds with the compiled html version.
</p>

<p class="footpara">
Part of that support was code for
<a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/0f270d6a112529b1507c7df079af6cf5acb9f6fc/_plugins/org-converter.rb#L19">automatically starting</a>
the required emacs process, so the service would be ready when Jekyll needed it.
This was tricky though and had bugs. As I learned Docker, it quickly became clear that it would work better as a separate service
specified in a <code>docker-compose</code> file.
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
with a small base image, you end up needing to specify <b>everything</b> for your app. In my experience, an app that runs easily on regular ubuntu 16.04
does not mean it works on the ubuntu:16.04 image just as easily, for example.
</p>

<p class="footpara">
Eventually I looked at the repo I had evaluated ealier (<a href="https://github.com/envygeeks/jekyll-docker">https://github.com/envygeeks/jekyll-docker</a>),
which I was able to use as an example.
What I ended up with (<a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/writing/_jekyll-image/Dockerfile">https://github.com/joelmccracken/joelmccracken.github.com/blob/writing/_jekyll-image/Dockerfile</a>) was way more
complicated than I initially expected! <sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
Some of it is probably unnecessary and cargo-culted, but I tried pulling some of it out and ran into issues (e.g. not running as <code>jekyll</code> user).
</p></div>


</div>
</div>
                    </article>

                    <div id="disqus_thread"></div>
                    <script>
                     var disqus_shortname = 'joelmccracken'; // required: replace example with your forum shortname

                     var disqus_config = function () {
                         this.page.url = "http://joelmccracken.github.io/entries/dockerizing-blog/";
                         this.page.identifier = "/entries/dockerizing-blog";
                         this.page.title = "Dockerizing my Jekyll Blog";
                     };

                     (function() {  // REQUIRED CONFIGURATION VARIABLE: EDIT THE SHORTNAME BELOW
                         var d = document, s = d.createElement('script');

                         s.src = '//'+disqus_shortname+'.disqus.com/embed.js';  // IMPORTANT: Replace EXAMPLE with your forum shortname!
                         s.setAttribute('data-timestamp', +new Date());
                         (d.head || d.body).appendChild(s);
                     })();
                    </script>
                    <noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
                </div>
            </div>
        </div>

        <footer class="site-footer">

  <div class="wrap">

    <h2 class="footer-heading">Joel McCracken</h2>

    <div class="footer-col-1 column">
      <ul>
        <li><a href="mailto:mccracken.joel@gmail.com">mccracken.joel@gmail.com</a></li>
      </ul>
    </div>

    <div class="footer-col-2 column">
      <ul>
        <li>
          <a href="https://github.com/JoelMcCracken">
            <span class="icon github">
              <svg version="1.1" class="github-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill-rule="evenodd" clip-rule="evenodd" fill="#C2C2C2" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761
                c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32
                c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472
                c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037
                C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65
                c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261
                c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082
                c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129
                c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
        <li>
          <a href="https://twitter.com/JoelMcCracken">
            <span class="icon twitter">
              <svg version="1.1" class="twitter-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill="#C2C2C2" d="M15.969,3.058c-0.586,0.26-1.217,0.436-1.878,0.515c0.675-0.405,1.194-1.045,1.438-1.809
                c-0.632,0.375-1.332,0.647-2.076,0.793c-0.596-0.636-1.446-1.033-2.387-1.033c-1.806,0-3.27,1.464-3.27,3.27
                c0,0.256,0.029,0.506,0.085,0.745C5.163,5.404,2.753,4.102,1.14,2.124C0.859,2.607,0.698,3.168,0.698,3.767
                c0,1.134,0.577,2.135,1.455,2.722C1.616,6.472,1.112,6.325,0.671,6.08c0,0.014,0,0.027,0,0.041c0,1.584,1.127,2.906,2.623,3.206
                C3.02,9.402,2.731,9.442,2.433,9.442c-0.211,0-0.416-0.021-0.615-0.059c0.416,1.299,1.624,2.245,3.055,2.271
                c-1.119,0.877-2.529,1.4-4.061,1.4c-0.264,0-0.524-0.015-0.78-0.046c1.447,0.928,3.166,1.469,5.013,1.469
                c6.015,0,9.304-4.983,9.304-9.304c0-0.142-0.003-0.283-0.009-0.423C14.976,4.29,15.531,3.714,15.969,3.058z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
      </ul>
    </div>

    <!-- 
    <div class="footer-col-3 column">
      <p class="text">would like to add some rotating content down here</p>
    </div>
    -->
  </div>

</footer>


        <script type="text/javascript">
 var _gaq = _gaq || [];
 _gaq.push(['_setAccount', 'UA-7759066-1']);
 _gaq.push(['_trackPageview']);

 (function() {
   var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
   ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
   var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
 })();
</script>

    </body>
</html>
